{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Untitled1.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# Cài đặt, cấu hình "
      ],
      "metadata": {
        "id": "x-9JKUBIouCo"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Trước tiên, ta tải các package cần thiết như Java, Spark, findspark"
      ],
      "metadata": {
        "id": "KNRfsLdm6TK5"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "dFwbWCdTFx3N"
      },
      "outputs": [],
      "source": [
        "!apt-get install openjdk-8-jdk-headless -qq > /dev/null\n",
        "!wget -q https://downloads.apache.org/spark/spark-3.2.1/spark-3.2.1-bin-hadoop3.2.tgz\n",
        "!tar xf spark-3.2.1-bin-hadoop3.2.tgz\n",
        "!pip install -q findspark"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!apt-get install openjdk-8-jdk-headless -qq > /dev/null"
      ],
      "metadata": {
        "id": "OjYO7VYq2eG7"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "Tiếp theo, ta tải file jar có nhiệm vụ là 1 connector giữa Spark và Neo4j. Thông tin thêm [tại đây](https://neo4j.com/docs/spark/current/overview/)"
      ],
      "metadata": {
        "id": "KKz1ZKYH6gTL"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "!wget https://github.com/neo4j-contrib/neo4j-spark-connector/releases/download/4.1.2/neo4j-connector-apache-spark_2.12-4.1.2_for_spark_3.jar"
      ],
      "metadata": {
        "id": "zLrS0sPRvJU8",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "bd5a5e61-5305-40cf-a9f0-2b6ca9fac85e"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "--2022-06-16 04:32:21--  https://github.com/neo4j-contrib/neo4j-spark-connector/releases/download/4.1.2/neo4j-connector-apache-spark_2.12-4.1.2_for_spark_3.jar\n",
            "Resolving github.com (github.com)... 140.82.112.3\n",
            "Connecting to github.com (github.com)|140.82.112.3|:443... connected.\n",
            "HTTP request sent, awaiting response... 302 Found\n",
            "Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/53063706/4fb869d3-6d45-4447-b31c-3f2e2a4515e6?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20220616%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220616T043221Z&X-Amz-Expires=300&X-Amz-Signature=e4aee72778c26f587e1720a55dc76e44b380de4891039cabf7e4e5b725258d94&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=53063706&response-content-disposition=attachment%3B%20filename%3Dneo4j-connector-apache-spark_2.12-4.1.2_for_spark_3.jar&response-content-type=application%2Foctet-stream [following]\n",
            "--2022-06-16 04:32:21--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/53063706/4fb869d3-6d45-4447-b31c-3f2e2a4515e6?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20220616%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220616T043221Z&X-Amz-Expires=300&X-Amz-Signature=e4aee72778c26f587e1720a55dc76e44b380de4891039cabf7e4e5b725258d94&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=53063706&response-content-disposition=attachment%3B%20filename%3Dneo4j-connector-apache-spark_2.12-4.1.2_for_spark_3.jar&response-content-type=application%2Foctet-stream\n",
            "Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.111.133, 185.199.109.133, 185.199.108.133, ...\n",
            "Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.111.133|:443... connected.\n",
            "HTTP request sent, awaiting response... 200 OK\n",
            "Length: 5808017 (5.5M) [application/octet-stream]\n",
            "Saving to: ‘neo4j-connector-apache-spark_2.12-4.1.2_for_spark_3.jar’\n",
            "\n",
            "neo4j-connector-apa 100%[===================>]   5.54M  --.-KB/s    in 0.03s   \n",
            "\n",
            "2022-06-16 04:32:21 (169 MB/s) - ‘neo4j-connector-apache-spark_2.12-4.1.2_for_spark_3.jar’ saved [5808017/5808017]\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "import os\n",
        "os.environ[\"JAVA_HOME\"] = \"/usr/lib/jvm/java-8-openjdk-amd64\"\n",
        "os.environ[\"SPARK_HOME\"] = \"/content/spark-3.2.1-bin-hadoop3.2\""
      ],
      "metadata": {
        "id": "toclGPEyidYW"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "import findspark\n",
        "findspark.init()"
      ],
      "metadata": {
        "id": "75E-asjRiyyo"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "Tạo một SparkSession với 1 `config` để add thêm connector giữa Neo4j và Spark vào Cluster."
      ],
      "metadata": {
        "id": "Tr9oeNR666W1"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import pyspark\n",
        "from pyspark import SparkConf, SparkContext\n",
        "from pyspark.sql import SparkSession\n",
        "spark = SparkSession.builder.master(\"local\")\\\n",
        "                            .config(\"spark.jars\", \"/content/neo4j-connector-apache-spark_2.12-4.1.2_for_spark_3.jar\")\\\n",
        "                            .getOrCreate()"
      ],
      "metadata": {
        "id": "_ujwyHrEktj-"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Truy vấn và phân tích"
      ],
      "metadata": {
        "id": "o28GcHOVudY8"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Neo4j em sử dụng là service Neo4j AuraDB. Một service cloud miễn phi do Neo4j cung cấp. Ở trên này em đã tạo sẵn một đồ thị movie có các Label là `Movie` và `Person`. Các relationship như `ACTED_IN`, `DIRECTED`, `FOLLOWS`, `PRODUCED`, `REVIEWED`, `WROTE`. Ta có thể nhìn sơ bộ graph database này."
      ],
      "metadata": {
        "id": "0_QFYo-2yWpL"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "![movie graph database](https://i.ibb.co/fpdFkcv/image.png)"
      ],
      "metadata": {
        "id": "othGCovKzJbz"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Trước tiên ta có thể  query băng API của spark gọi bằng cách đưa entity và value của nó. Ví dụ, ta có thể tìm các Node có nhãn là `Movie` như sau."
      ],
      "metadata": {
        "id": "8UeSdWTy0HPy"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = spark.read.format(\"org.neo4j.spark.DataSource\")\\\n",
        "          .option(\"url\", \"neo4j+s://2d19c443.databases.neo4j.io\")\\\n",
        "          .option(\"authentication.type\", \"basic\")\\\n",
        "          .option(\"authentication.basic.username\", \"neo4j\")\\\n",
        "          .option(\"authentication.basic.password\", \"ukgXJUy8iESojlfNS6NP6MrTZj2IfsMD7_FTEPEP9xo\")\\\n",
        "          .option(\"labels\", \"Movie\")\\\n",
        "          .load()"
      ],
      "metadata": {
        "id": "eFhNsgyZmztk"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df.show(20, False)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "KZNJ6Iea5Q62",
        "outputId": "4ad359a7-bafa-4eef-fcb8-79fd2c5c3e33"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "+----+--------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+\n",
            "|<id>|<labels>|title                 |tagline                                                                                                                                                                      |released|\n",
            "+----+--------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+\n",
            "|0   |[Movie] |The Matrix            |Welcome to the Real World                                                                                                                                                    |1999    |\n",
            "|9   |[Movie] |The Matrix Reloaded   |Free your mind                                                                                                                                                               |2003    |\n",
            "|10  |[Movie] |The Matrix Revolutions|Everything that has a beginning has an end                                                                                                                                   |2003    |\n",
            "|11  |[Movie] |The Devil's Advocate  |Evil has its winning ways                                                                                                                                                    |1997    |\n",
            "|15  |[Movie] |A Few Good Men        |In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.|1992    |\n",
            "|29  |[Movie] |Top Gun               |I feel the need, the need for speed.                                                                                                                                         |1986    |\n",
            "|37  |[Movie] |Jerry Maguire         |The rest of his life begins now.                                                                                                                                             |2000    |\n",
            "|46  |[Movie] |Stand By Me           |For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.                                |1986    |\n",
            "|52  |[Movie] |As Good as It Gets    |A comedy from the heart that goes for the throat.                                                                                                                            |1997    |\n",
            "|56  |[Movie] |What Dreams May Come  |After life there is more. The end is just the beginning.                                                                                                                     |1998    |\n",
            "|62  |[Movie] |Snow Falling on Cedars|First loves last. Forever.                                                                                                                                                   |1999    |\n",
            "|67  |[Movie] |You've Got Mail       |At odds in life... in love on-line.                                                                                                                                          |1998    |\n",
            "|73  |[Movie] |Sleepless in Seattle  |What if someone you never met, someone you never saw, someone you never knew was the only someone for you?                                                                   |1993    |\n",
            "|78  |[Movie] |Joe Versus the Volcano|A story of love, lava and burning desire.                                                                                                                                    |1990    |\n",
            "|81  |[Movie] |When Harry Met Sally  |Can two friends sleep together and still love each other in the morning?                                                                                                     |1998    |\n",
            "|85  |[Movie] |That Thing You Do     |In every life there comes a time when that thing you dream becomes that thing you do                                                                                         |1996    |\n",
            "|87  |[Movie] |The Replacements      |Pain heals, Chicks dig scars... Glory lasts forever                                                                                                                          |2000    |\n",
            "|92  |[Movie] |RescueDawn            |Based on the extraordinary true story of one man's fight for freedom                                                                                                         |2006    |\n",
            "|95  |[Movie] |The Birdcage          |Come as you are                                                                                                                                                              |1996    |\n",
            "|97  |[Movie] |Unforgiven            |It's a hell of a thing, killing a man                                                                                                                                        |1992    |\n",
            "+----+--------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+\n",
            "only showing top 20 rows\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ta cũng có thể làm tương tự với relationship."
      ],
      "metadata": {
        "id": "BnRDq6Kj23JZ"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = spark.read.format(\"org.neo4j.spark.DataSource\")\\\n",
        "          .option(\"url\", \"neo4j+s://2d19c443.databases.neo4j.io\")\\\n",
        "          .option(\"authentication.type\", \"basic\")\\\n",
        "          .option(\"authentication.basic.username\", \"neo4j\")\\\n",
        "          .option(\"authentication.basic.password\", \"ukgXJUy8iESojlfNS6NP6MrTZj2IfsMD7_FTEPEP9xo\")\\\n",
        "          .option(\"relationship\", \"ACTED_IN\")\\\n",
        "          .option(\"relationship.source.labels\", \"Person\")\\\n",
        "          .option(\"relationship.target.labels\", \"Movie\")\\\n",
        "          .load()"
      ],
      "metadata": {
        "id": "a7G5tqxw3Ebs"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df.show()"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "vdgjoDqW39Al",
        "outputId": "422f0b8d-4aff-4351-98d5-c92120ebada0"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "+--------+----------+-----------+---------------+------------------+-----------+-----------+---------------+--------------------+--------------------+---------------+--------------------+\n",
            "|<rel.id>|<rel.type>|<source.id>|<source.labels>|       source.name|source.born|<target.id>|<target.labels>|        target.title|      target.tagline|target.released|           rel.roles|\n",
            "+--------+----------+-----------+---------------+------------------+-----------+-----------+---------------+--------------------+--------------------+---------------+--------------------+\n",
            "|       7|  ACTED_IN|          8|       [Person]|       Emil Eifrem|       1978|          0|        [Movie]|          The Matrix|Welcome to the Re...|           1999|              [Emil]|\n",
            "|       3|  ACTED_IN|          4|       [Person]|      Hugo Weaving|       1960|          0|        [Movie]|          The Matrix|Welcome to the Re...|           1999|       [Agent Smith]|\n",
            "|       2|  ACTED_IN|          3|       [Person]|Laurence Fishburne|       1961|          0|        [Movie]|          The Matrix|Welcome to the Re...|           1999|          [Morpheus]|\n",
            "|       1|  ACTED_IN|          2|       [Person]|  Carrie-Anne Moss|       1967|          0|        [Movie]|          The Matrix|Welcome to the Re...|           1999|           [Trinity]|\n",
            "|       0|  ACTED_IN|          1|       [Person]|      Keanu Reeves|       1964|          0|        [Movie]|          The Matrix|Welcome to the Re...|           1999|               [Neo]|\n",
            "|      11|  ACTED_IN|          4|       [Person]|      Hugo Weaving|       1960|          9|        [Movie]| The Matrix Reloaded|      Free your mind|           2003|       [Agent Smith]|\n",
            "|      10|  ACTED_IN|          3|       [Person]|Laurence Fishburne|       1961|          9|        [Movie]| The Matrix Reloaded|      Free your mind|           2003|          [Morpheus]|\n",
            "|       9|  ACTED_IN|          2|       [Person]|  Carrie-Anne Moss|       1967|          9|        [Movie]| The Matrix Reloaded|      Free your mind|           2003|           [Trinity]|\n",
            "|       8|  ACTED_IN|          1|       [Person]|      Keanu Reeves|       1964|          9|        [Movie]| The Matrix Reloaded|      Free your mind|           2003|               [Neo]|\n",
            "|      18|  ACTED_IN|          4|       [Person]|      Hugo Weaving|       1960|         10|        [Movie]|The Matrix Revolu...|Everything that h...|           2003|       [Agent Smith]|\n",
            "|      17|  ACTED_IN|          3|       [Person]|Laurence Fishburne|       1961|         10|        [Movie]|The Matrix Revolu...|Everything that h...|           2003|          [Morpheus]|\n",
            "|      16|  ACTED_IN|          2|       [Person]|  Carrie-Anne Moss|       1967|         10|        [Movie]|The Matrix Revolu...|Everything that h...|           2003|           [Trinity]|\n",
            "|      15|  ACTED_IN|          1|       [Person]|      Keanu Reeves|       1964|         10|        [Movie]|The Matrix Revolu...|Everything that h...|           2003|               [Neo]|\n",
            "|      24|  ACTED_IN|         13|       [Person]|         Al Pacino|       1940|         11|        [Movie]|The Devil's Advocate|Evil has its winn...|           1997|       [John Milton]|\n",
            "|      23|  ACTED_IN|         12|       [Person]|   Charlize Theron|       1975|         11|        [Movie]|The Devil's Advocate|Evil has its winn...|           1997|    [Mary Ann Lomax]|\n",
            "|      22|  ACTED_IN|          1|       [Person]|      Keanu Reeves|       1964|         11|        [Movie]|The Devil's Advocate|Evil has its winn...|           1997|       [Kevin Lomax]|\n",
            "|      35|  ACTED_IN|         25|       [Person]|    James Marshall|       1967|         15|        [Movie]|      A Few Good Men|In the heart of t...|           1992|[Pfc. Louden Downey]|\n",
            "|      33|  ACTED_IN|         23|       [Person]|      Kevin Pollak|       1957|         15|        [Movie]|      A Few Good Men|In the heart of t...|           1992|  [Lt. Sam Weinberg]|\n",
            "|      34|  ACTED_IN|         24|       [Person]|        J.T. Walsh|       1943|         15|        [Movie]|      A Few Good Men|In the heart of t...|           1992|[Lt. Col. Matthew...|\n",
            "|      37|  ACTED_IN|         28|       [Person]|      Aaron Sorkin|       1961|         15|        [Movie]|      A Few Good Men|In the heart of t...|           1992|        [Man in Bar]|\n",
            "+--------+----------+-----------+---------------+------------------+-----------+-----------+---------------+--------------------+--------------------+---------------+--------------------+\n",
            "only showing top 20 rows\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ta có thể dễ dàng thấy được các thông tin như diễn viên Emil Eifrem đóng trong bộ phim The Matrix, vv.."
      ],
      "metadata": {
        "id": "-ZJoOxZd4He_"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ta cũng có thể  dùng trực tiếp CQL trong api của Spark. Như sau"
      ],
      "metadata": {
        "id": "Qz2Xa_YW4YsC"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = spark.read.format(\"org.neo4j.spark.DataSource\")\\\n",
        "          .option(\"url\", \"neo4j+s://2d19c443.databases.neo4j.io\")\\\n",
        "          .option(\"authentication.type\", \"basic\")\\\n",
        "          .option(\"authentication.basic.username\", \"neo4j\")\\\n",
        "          .option(\"authentication.basic.password\", \"ukgXJUy8iESojlfNS6NP6MrTZj2IfsMD7_FTEPEP9xo\")\\\n",
        "          .option(\"query\", \"MATCH (n:Person) WITH n LIMIT 2 RETURN id(n) as id, n.name as name\")\\\n",
        "          .load()"
      ],
      "metadata": {
        "id": "IUPQovco4xIJ"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df.show()"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "1ZBjuts55WyV",
        "outputId": "24d52c41-817f-49d9-fca7-673483dbc9e8"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "+---+----------------+\n",
            "| id|            name|\n",
            "+---+----------------+\n",
            "|  1|    Keanu Reeves|\n",
            "|  2|Carrie-Anne Moss|\n",
            "+---+----------------+\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ta đã đi qua sơ lược các cách có thể query đến Neo4j database bằng Spark. Tiếp đến, nhóm sẽ thực hiện các câu query để  hiểu thêm thông tin về dữ liệu."
      ],
      "metadata": {
        "id": "ci7D0NEd4yn4"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ta thấy có diễn viên khá nổi tiếng là Keanu Reeves ở dữ liệu trên, vậy ta xem có bao nhiêu bộ phim anh ấy đã đóng trong dữ liệu này"
      ],
      "metadata": {
        "id": "kHtBJQ1m5FeD"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = spark.read.format(\"org.neo4j.spark.DataSource\")\\\n",
        "          .option(\"url\", \"neo4j+s://2d19c443.databases.neo4j.io\")\\\n",
        "          .option(\"authentication.type\", \"basic\")\\\n",
        "          .option(\"authentication.basic.username\", \"neo4j\")\\\n",
        "          .option(\"authentication.basic.password\", \"ukgXJUy8iESojlfNS6NP6MrTZj2IfsMD7_FTEPEP9xo\")\\\n",
        "          .option(\"query\", \"MATCH (Keanu:Person {name: 'Keanu Reeves'})-[:ACTED_IN]->(p:Movie) RETURN p.title, p.tagline, p.released\")\\\n",
        "          .load()"
      ],
      "metadata": {
        "id": "6rSbvKJl52H7"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df.show(20, False)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "0l31TW555-T4",
        "outputId": "0c5860b5-8dff-4d03-c1d6-fe25683f76b6"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "+----------------------+------------------------------------------------------+----------+\n",
            "|p.title               |p.tagline                                             |p.released|\n",
            "+----------------------+------------------------------------------------------+----------+\n",
            "|Something's Gotta Give|null                                                  |2003      |\n",
            "|The Replacements      |Pain heals, Chicks dig scars... Glory lasts forever   |2000      |\n",
            "|Johnny Mnemonic       |The hottest data on earth. In the coolest head in town|1995      |\n",
            "|The Devil's Advocate  |Evil has its winning ways                             |1997      |\n",
            "|The Matrix Revolutions|Everything that has a beginning has an end            |2003      |\n",
            "|The Matrix Reloaded   |Free your mind                                        |2003      |\n",
            "|The Matrix            |Welcome to the Real World                             |1999      |\n",
            "+----------------------+------------------------------------------------------+----------+\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ta cũng sẽ tìm thử xem những diễn viên nào đã đóng chung với Keanu Reeves bằng cách sau"
      ],
      "metadata": {
        "id": "77Y6ZUNA6ZaW"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = spark.read.format(\"org.neo4j.spark.DataSource\")\\\n",
        "          .option(\"url\", \"neo4j+s://2d19c443.databases.neo4j.io\")\\\n",
        "          .option(\"authentication.type\", \"basic\")\\\n",
        "          .option(\"authentication.basic.username\", \"neo4j\")\\\n",
        "          .option(\"authentication.basic.password\", \"ukgXJUy8iESojlfNS6NP6MrTZj2IfsMD7_FTEPEP9xo\")\\\n",
        "          .option(\"query\", \"MATCH (Keanu:Person {name: 'Keanu Reeves'})-[:ACTED_IN]->(:Movie)<-[:ACTED_IN]-(p:Person ) \\\n",
        "                  RETURN DISTINCT p.name, p.born\")\\\n",
        "          .load()"
      ],
      "metadata": {
        "id": "XNBh60wW6pbo"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df.show(20, False)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "nQezWy6E8f4e",
        "outputId": "baada89c-0109-4bd0-8c0c-bec63c654019"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "+------------------+------+\n",
            "|p.name            |p.born|\n",
            "+------------------+------+\n",
            "|Diane Keaton      |1946  |\n",
            "|Jack Nicholson    |1937  |\n",
            "|Brooke Langton    |1970  |\n",
            "|Orlando Jones     |1968  |\n",
            "|Gene Hackman      |1930  |\n",
            "|Ice-T             |1958  |\n",
            "|Dina Meyer        |1968  |\n",
            "|Takeshi Kitano    |1947  |\n",
            "|Al Pacino         |1940  |\n",
            "|Charlize Theron   |1975  |\n",
            "|Hugo Weaving      |1960  |\n",
            "|Laurence Fishburne|1961  |\n",
            "|Carrie-Anne Moss  |1967  |\n",
            "|Emil Eifrem       |1978  |\n",
            "+------------------+------+\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Điểm mạnh của CQL đó là ta không cần biết Keanu đã đóng phim gì, ta chỉ cần có logic đơn giản đó là Keanu có mối quan hệ `ACTED_IN` vào một bộ phim nào đó, thì những diễn viên đóng chung với Keanu sẽ phải có mối quan hệ `ACTED_IN` vào bộ phim mà Keanu đã đóng."
      ],
      "metadata": {
        "id": "P4TUi0U38pVX"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Tiếp theo ta cũng sẽ sử dụng sức mạnh của graph database đó là việc kết nối. Giả sử ta muốn xem các diễn viên có mỗi quan hệ như thế nào. Ví dụ A follow B, B follow C, rối C follow A. Một yêu cầu rất mơ hồ, mà khi sử dụng RDBMS sẽ khó khăn khi truy vấn. Thì ở Neo4j mọi chuyện rất dơn giản."
      ],
      "metadata": {
        "id": "PfmtVaTj9UTh"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = spark.read.format(\"org.neo4j.spark.DataSource\")\\\n",
        "          .option(\"url\", \"neo4j+s://2d19c443.databases.neo4j.io\")\\\n",
        "          .option(\"authentication.type\", \"basic\")\\\n",
        "          .option(\"authentication.basic.username\", \"neo4j\")\\\n",
        "          .option(\"authentication.basic.password\", \"ukgXJUy8iESojlfNS6NP6MrTZj2IfsMD7_FTEPEP9xo\")\\\n",
        "          .option(\"query\", \"MATCH p = (:Person)-[:FOLLOWS]->(:Person) return nodes(p)\")\\\n",
        "          .load()"
      ],
      "metadata": {
        "id": "LY8es0q095Cy"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df.show(20, False)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "4Qd24e_8-Zlg",
        "outputId": "1dbb71b3-b235-4dfb-e800-34719ec29eb2"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "+--------------------------------------------------------------------+\n",
            "|nodes(p)                                                            |\n",
            "+--------------------------------------------------------------------+\n",
            "|[{167, [Person], Paul Blythe}, {168, [Person], Angela Scope}]       |\n",
            "|[{168, [Person], Angela Scope}, {169, [Person], Jessica Thompson}]  |\n",
            "|[{170, [Person], James Thompson}, {169, [Person], Jessica Thompson}]|\n",
            "+--------------------------------------------------------------------+\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Phần trình bày Spark and Neo4j của nhóm kết thúc ở đây. Xin cảm ơn cô và thầy đã xem."
      ],
      "metadata": {
        "id": "xq5JMlw7_CDL"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "spark.stop()"
      ],
      "metadata": {
        "id": "JWZPJq5M5mdd"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}